---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.IOException
source: html/d847c1b0-68d2-ff95-f20c-c08fee513e54.htm
---
# IOException Methods

Retrieves data needed to serialize the target object.